<?php
namespace Library;
class URL {
    
    public static function getName(string $url=''):string
    {
        //self::convertNotAllowedCharacters($url);
        //echo "\rStart URL:\n";
        //echo $url."\n";
        if(is_null($url)) {return "";};
        if(!is_string($url)) {return "";};
        if(trim($url)===''){ return "";};
        
        
         /* REPLACE WHITE CHARACTERS */
        $url=preg_replace('/\s/', '-', $url);
        /* REPLACE & */
        $url=preg_replace('/\&/', '-and-', $url);
        /* REPALCE CHARACTERS */
        $url=self::replaceCharacters($url);

        /* REPALCE / AND \ AND -- MORE THAN 2 TO - */
       // $url=preg_replace('/(\\\|\/)+/', '-', $url);//|-{2,}
        /* REPLACE ALL NOT AVAILABLE CHARACTERS TO - */
        //$url=preg_replace('/(\\\|\/)+/', '-', $url);//|-{2,}
        /* LAST REPLACE -{2,} TO PRERVENT AFTER remove white char -/- and next remove / return --- */
        $url=preg_replace('/(-{2,})+/', '-', $url);
        /* REMOVE LAST SPECIAL CHARACTER INCLUDE _*/
        $url=preg_replace('/(\W|\_)+$/', '', $url);
        /* REMOVE FIRST SPECIAL CHARACTER INCLUDE _*/
        $url=preg_replace('/^(\W)+/', '', $url);
        //echo "Returned URL:\n";
        //echo $url;
        //die();
        return $url;
    }
    public static function replaceCharacters($s='')
    {         
        $newString='';
        //echo "Replace:\n";
        //echo "Before:\n";
        //echo $s."\n";
        $new='';
        $tmp=[];
        $mb_ord=[];
        for($i=0;$i<mb_strlen($s);$i++){
            $tmp[0]=mb_substr($s,$i,1);
            $mb_ord[0]=strval(mb_ord($tmp[0]));
            self::replaceSpecialCharacter($mb_ord,$tmp);
            self::replaceAlphabetCharacter($mb_ord,$tmp);
            self::replaceNotAvailable($tmp);
            $new.=implode($tmp);
            $mb_ord=[];
            $tmp=[];
        }
        //echo "After:\n";
        //echo $new."\n";
        return $new;
    }
    public static function replaceNotAvailable(array &$char=[]):void
    {
        /*
            45 - -
            48 - 0
            49 - 1
            50 - 2
            51 - 3
            52 - 4
            53 - 5
            54 - 6
            55 - 7
            56 - 8
            57 - 9
            97 - a
            98 - b
            99 - c
            100 - d
            101 - e
            102 - f
            103 - g
            104 - h
            105 - i
            106 - j
            107 - k
            108 - l
            109 - m
            110 - n
            111 - o
            112 - p
            113 - q
            114 - r
            115 - s
            116 - t
            117 - u
            119 - w
            120 - x
            121 - y
            122 - z
         */
        //$available=[
        //    45,48,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,119,120,121,122
        //];

        foreach($char as &$c){
            if(!in_array(mb_ord($c), array_merge([45],range(48,57),range(97,122)))){
                $c='-';
            }
        }
    }
    public static function replaceSpecialCharacter(array &$mb_ord=[],array &$char=[]):void
    {
        /*
        @ - 64 - a
        $ - 36 - s
        × - 215 - x
        _ - 95 - -
         */
       
        $available=[
            '64'=>'a','36'=>'s','95'=>'-'
        ];
        if(array_key_exists($mb_ord[0],$available)){
            $char[0]=$available[$mb_ord[0]];
            $mb_ord[0]=strval(mb_ord($char[0]));
        }
    }
    public static function replaceAlphabetCharacter(array &$mb_ord=[],array &$char=[]):void
    {
        /* REPLACE (with original upper to lower)
        À - 192 - A - a
        Á - 193 - A - a
        Â - 194 - A - a
        Ã - 195 - A - a
        Ä - 196 - AE - ae
        Å - 197 - A - a
        Ā - 256 - A - a
        Ą - 260 - A - a
        Ă - 258 - A - a
        Æ - 198 - Ae - ae
        Ç - 199 - C - c
        Ć - 262 - C - ....
        Č - 268 - C
        Ĉ - 264 - C
        Ċ - 266 - C
        Ď - 270 - D
        Đ - 272 - D
        Ð - 208 - D
        È - 200 - E
        É - 201 - E
        Ê - 202 - E
        Ë - 203 - E - e
        Ē - 274 - E
        Ę - 280 - E
        Ě - 282 - E
        Ĕ - 276 - E
        Ė - 278 - E
        Ĝ - 284 - G
        Ğ - 286 - G
        Ġ - 288 - G
        Ģ - 290 - G
        Ĥ - 292 - H
        Ħ - 294 - H
        Ì - 204 - I
        Í - 205 - I
        Î - 206 - I
        Ï - 207 - I
        Ī - 298 - I
        Ĩ - 296 - I
        Ĭ - 300 - I
        Į - 302 - I
        İ - 304 - I
        Ĳ - 306 - IJ - ij
        Ĵ - 308 - J
        Ķ - 310 - K
        Ł - 321 - L
        Ľ - 317 - L
        Ĺ - 313 - L
        Ļ - 315 - L
        Ŀ - 319 - L
        Ñ - 209 - N
        Ń - 323 - N
        Ň - 327 - N
        Ņ - 325 - N
        Ŋ - 330 - N
        Ò - 210 - O
        Ó - 211 - O
        Ô - 212 - O
        Õ - 213 - O
        Ö - 214 - OE - oe
        Ø - 216 - O
        Ō - 332 - O
        Ő - 336 - O
        Ŏ - 334 - O
        Œ - 338 - OE
        Ŕ - 340 - R
        Ř - 344 - R
        Ŗ - 342 - R
        Ś - 346 - S
        Š - 352 - S
        Ş - 350 - S
        Ŝ - 348 - S
        Ș - 536 - S
        Ť - 356 - T
        Ţ - 354 - T
        Ŧ - 358 - T
        Ț - 538 - T
        Ù - 217 - U
        Ú - 218 - U
        Û - 219 - U
        Ü - 220 - UE - ue
        Ū - 362 - U
        Ů - 366 - U
        Ű - 368 - U
        Ŭ - 364 - U
        Ũ - 360 - U
        Ų - 370 - U
        Ŵ - 372 - W
        Ý - 221 - Y
        Ŷ - 374 - Y
        Ÿ - 376 - Y
        Ź - 377 - Z
        Ž - 381 - Z
        Ż - 379 - Z
        Þ - 222 - T
        à - 224 - a
        á - 225 - a
        â - 226 - a
        ã - 227 - a
        ä - 228 - ae
        ü - 252 - ue
        å - 229 - a
        ā - 257 - a
        ą - 261 - a
        ă - 259 - a
        æ - 230 - ae
        ç - 231 - c
        ć - 263 - c
        č - 269 - c
        ĉ - 265 - c
        ċ - 267 - c
        ď - 271 - d
        đ - 273 - d
        ð - 240 - d
        è - 232 - e
        é - 233 - e
        ê - 234 - e
        ë - 235 - e
        ē - 275 - e
        ę - 281 - e
        ě - 283 - e
        ĕ - 277 - e
        ė - 279 - e
        ƒ - 402 - f
        ĝ - 285 - g
        ğ - 287 - g
        ġ - 289 - g
        ģ - 291 - g
        ĥ - 293 - h
        ħ - 295 - h
        ì - 236 - i
        í - 237 - i
        î - 238 - i
        ï - 239 - i
        ī - 299 - i
        ĩ - 297 - i
        ĭ - 301 - i
        į - 303 - i
        ı - 305 - i
        ĳ - 307 - ij
        ĵ - 309 - j
        ķ - 311 - k
        ĸ - 312 - k
        ł - 322 - l
        ľ - 318 - l
        ĺ - 314 - l
        ļ - 316 - l
        ŀ - 320 - l
        ñ - 241 - n
        ń - 324 - n
        ň - 328 - n
        ņ - 326 - n
        ŉ - 329 - n
        ŋ - 331 - n
        ò - 242 - o
        ó - 243 - o
        ô - 244 - o
        õ - 245 - o
        ö - 246 - oe
        ø - 248 - o
        ō - 333 - o
        ő - 337 - o
        ŏ - 335 - o
        œ - 339 - oe
        ŕ - 341 - r
        ř - 345 - r
        ŗ - 343 - r
        ś - 347 - s
        š - 353 - s
        ù - 249 - u
        ú - 250 - u
        û - 251 - u
        ū - 363 - u
        ů - 367 - u
        ű - 369 - u
        ŭ - 365 - u
        ũ - 361 - u
        ų - 371 - u
        ŵ - 373 - w
        ý - 253 - y
        ÿ - 255 - y
        ŷ - 375 - y
        ž - 382 - z
        ż - 380 - z
        ź - 378 - z
        þ - 254 - t
        ß - 223 - ss
        ſ - 383 - ss
        А - 1040 - A
        Б - 1041 - B
        В - 1042 - V
        Г - 1043 - G
        Д - 1044 - D
        Е - 1045 - E
        Ё - 1025 - YO
        Ж - 1046 - ZH
        З - 1047 - Z
        И - 1048 - I
        Й - 1049 - Y
        К - 1050 - K
        Л - 1051 - L
        М - 1052 - M
        Н - 1053 - N
        О - 1054 - O
        П - 1055 - P
        Р - 1056 - R
        С - 1057 - S
        Т - 1058 - T
        У - 1059 - U
        Ф - 1060 - F
        Х - 1061 - H
        Ц - 1062 - C
        Ч - 1063 - CH
        Ш - 1064 - SH
        Щ - 1065 - SCH
        Ъ - 1066 - b
        Ы - 1067 - Y
        Ь - 1068 - b
        Э - 1069 - E
        Ю - 1070 - YU
        Я - 1071 - YA
        а - 1072 - a
        б - 1073 - b
        в - 1074 - v
        г - 1075 - g
        д - 1076 - d
        е - 1077 - e
        ё - 1105 - yo
        ж - 1078 - zh
        з - 1079 - z
        и - 1080 - i
        й - 1081 - y
        к - 1082 - k
        л - 1083 - l
        м - 1084 - m
        н - 1085 - n
        о - 1086 - o
        п - 1087 - p
        р - 1088 - r
        с - 1089 - s
        т - 1090 - t
        у - 1091 - u
        ф - 1092 - f
        х - 1093 - h
        ц - 1094 - c
        ч - 1095 - ch
        ш - 1096 - sh
        щ - 1097 - sch
        ъ - 1098 - b
        ы - 1099 - y
        ь - 1100 - b
        э - 1101 - e
        ю - 1102 - yu
        я - 1103 - ya
         */
        $available=[
            '65'=>'a','66'=>'b','67'=>'c','68'=>'d','69'=>'e','70'=>'f','71'=>'g','72'=>'h','73'=>'i','74'=>'j','75'=>'k','76'=>'l',
            '77'=>'m','78'=>'n','79'=>'o','80'=>'p','81'=>'q','82'=>'r','83'=>'s','84'=>'t','85'=>'u','86'=>'v','87'=>'w','88'=>'x',
            '89'=>'y','90'=>'z',
            '192' => 'a','193' => 'a','194' => 'a','195' => 'a','196' => 'ae','197' => 'a','256' => 'a','260' => 'a','258' => 'a','198' => 'ae',
            '199' => 'c','262' => 'c','268' => 'c','264' => 'c','266' => 'c','270' => 'd','272' => 'd','208' => 'd','200' => 'e','201' => 'e',
            '202' => 'e','203' => 'e','274' => 'e','280' => 'e','282' => 'e','276' => 'e','278' => 'e','284' => 'g','286' => 'g','288' => 'g',
            '290' => 'g','292' => 'h','294' => 'h','204' => 'i','205' => 'i','206' => 'i','207' => 'i','298' => 'i','296' => 'i','300' => 'i',
            '302' => 'i','304' => 'i','306' => 'ij','308' => 'j','310' => 'k','321' => 'l','317' => 'l','313' => 'l','315' => 'l','319' => 'l',
            '209' => 'n','323' => 'n','327' => 'n','325' => 'n','330' => 'n','210' => 'o','211' => 'o','212' => 'o','213' => 'o','214' => 'oe',
            '216' => 'o','332' => 'o','336' => 'o','334' => 'o','338' => 'oe','340' => 'r','344' => 'r','342' => 'r','346' => 's','352' => 's',
            '350' => 's','348' => 's','536' => 's','356' => 't','354' => 't','358' => 't','538' => 't','217' => 'u','218' => 'u','219' => 'u',
            '220' => 'ue','362' => 'u','366' => 'u','368' => 'u','364' => 'u','360' => 'u','370' => 'u','372' => 'w','221' => 'y','374' => 'y',
            '376' => 'y','377' => 'z','381' => 'z','379' => 'z','222' => 't','224' => 'a','225' => 'a','226' => 'a','227' => 'a','228' => 'ae',
            '252' => 'ue','229' => 'a','257' => 'a','261' => 'a','259' => 'a','230' => 'ae','231' => 'c','263' => 'c','269' => 'c','265' => 'c',
            '267' => 'c','271' => 'd','273' => 'd','240' => 'd','232' => 'e','233' => 'e','234' => 'e','235' => 'e','275' => 'e','281' => 'e',
            '283' => 'e','277' => 'e','279' => 'e','402' => 'f','285' => 'g','287' => 'g','289' => 'g','291' => 'g','293' => 'h','295' => 'h',
            '236' => 'i','237' => 'i','238' => 'i','239' => 'i','299' => 'i','297' => 'i','301' => 'i','303' => 'i','305' => 'i','307' => 'ij',
            '309' => 'j','311' => 'k','312' => 'k','322' => 'l','318' => 'l','314' => 'l','316' => 'l','320' => 'l','241' => 'n','324' => 'n',
            '328' => 'n','326' => 'n','329' => 'n','331' => 'n','242' => 'o','243' => 'o','244' => 'o','245' => 'o','246' => 'oe','248' => 'o',
            '333' => 'o','337' => 'o','335' => 'o','339' => 'oe','341' => 'r','345' => 'r','343' => 'r','347' => 's','353' => 's','249' => 'u',
            '250' => 'u','251' => 'u','363' => 'u','367' => 'u','369' => 'u','365' => 'u','361' => 'u','371' => 'u','373' => 'w','253' => 'y',
            '255' => 'y','375' => 'y','382' => 'z','380' => 'z','378' => 'z','254' => 't','223' => 'ss','383' => 'ss','1040' => 'a','1041' => 'b',
            '1042' => 'V','1043' => 'g','1044' => 'd','1045' => 'e','1025' => 'yo','1046' => 'zh','1047' => 'z','1048' => 'i','1049' => 'y','1050' => 'k',
            '1051' => 'l','1052' => 'm','1053' => 'n','1054' => 'o','1055' => 'p','1056' => 'r','1057' => 's','1058' => 't','1059' => 'u','1060' => 'f',
            '1061' => 'h','1062' => 'c','1063' => 'ch','1064' => 'sh','1065' => 'sch','1066' => 'b','1067' => 'y','1068' => 'b','1069' => 'e','1070' => 'yu',
            '1071' => 'ya','1072' => 'a','1073' => 'b','1074' => 'v','1075' => 'g','1076' => 'd','1077' => 'e','1105' => 'yo','1078' => 'zh','1079' => 'z',
            '1080' => 'i','1081' => 'y','1082' => 'k','1083' => 'l','1084' => 'm','1085' => 'n','1086' => 'o','1087' => 'p','1088' => 'r','1089' => 's',
            '1090' => 't','1091' => 'u','1092' => 'f','1093' => 'h','1094' => 'c','1095' => 'ch','1096' => 'sh','1097' => 'sch','1098' => 'b','1099' => 'y',
            '1100' => 'b','1101' => 'e','1102' => 'yu','1103' => 'ya'
        ];
        if(array_key_exists($mb_ord[0],$available)){
            $tmp=$available[$mb_ord[0]];
            for($i=0;$i<strlen($tmp);$i++){
                $char[$i]=substr($tmp,$i,1);
                $mb_ord[$i]=strval(mb_ord($char[$i]));
            }
            //$char=
            //$mb_ord=strval(mb_ord($char));
        }
    }
}
